# Merging Data and Operations

In [1]:
import numpy as np
import pandas as pd

In [2]:
a={
    'Movies':['Star-Wars','Star-Wars','Batman','Batman','Deadpool','Deadpool'],
    'Viewers':['Me','MF','MOF','Bobby','Dean','Sammy'],
    'Ratings':[10,7,6,9,8,5]
}
a

{'Movies': ['Star-Wars',
  'Star-Wars',
  'Batman',
  'Batman',
  'Deadpool',
  'Deadpool'],
 'Viewers': ['Me', 'MF', 'MOF', 'Bobby', 'Dean', 'Sammy'],
 'Ratings': [10, 7, 6, 9, 8, 5]}

In [3]:
df=pd.DataFrame(a)
df

      Movies Viewers  Ratings
0  Star-Wars      Me       10
1  Star-Wars      MF        7
2     Batman     MOF        6
3     Batman   Bobby        9
4   Deadpool    Dean        8
5   Deadpool   Sammy        5

In [8]:
df.groupby('Movies').std()

           Ratings
Movies
Batman     2.12132
Deadpool   2.12132
Star-Wars  2.12132

In [9]:
df.groupby('Movies').describe()

          Ratings
            count mean      std  min   25%  50%   75%   max
Movies
Batman        2.0  7.5  2.12132  6.0  6.75  7.5  8.25   9.0
Deadpool      2.0  6.5  2.12132  5.0  5.75  6.5  7.25   8.0
Star-Wars     2.0  8.5  2.12132  7.0  7.75  8.5  9.25  10.0

# Reading and Writing Files

In [18]:
df=pd.read_csv('C:\\Users\\DELL\\Desktop\\MachineLearning\\pandas\example-csv.csv')
df

      1     2     3
0    11    22    33
1   111   222   333
2  1111  2222  3333

In [20]:
df.loc[2]

1    1111
2    2222
3    3333
Name: 2, dtype: int64

In [24]:
df.to_csv('C:\\Users\\DELL\\Desktop\\MachineLearning\\pandas\myoutput.csv',index=False)

In [25]:
pd.read_csv('C:\\Users\\DELL\\Desktop\\MachineLearning\\pandas\myoutput.csv')

      1     2     3
0    11    22    33
1   111   222   333
2  1111  2222  3333

In [31]:
edf=pd.read_excel('C:\\Users\\DELL\\Desktop\\MachineLearning\\pandas\exampleTwo.xlsx',sheet_name='Sheet2')
edf

   123  234
0  123  234

In [32]:
edf

   123  234
0  123  234